#将3.141592657 转换成 character
as.character(3.1415927)
#将3.141592657 转换成 logical
as.logical(3.1415927)
#判断"hello world"是否是⼀个character
is.character('hello world')
#判断⼀个NA是否是缺失值
is.na(NA)

v1 <- c(1,2,3,4)
v2 <- c(2,3,4,5)
v3 <- c(v1,v2)
v4 <- c(1,2,'c')

#取出v1的第2和第3个元素
v1[c(F,T,T,F)]

#取出v1的最后⼀个元素
length(v1)
v1[4]
v1[length(v1)]

#取出v1的倒数第⼆个元素
rev(v1)[2]

#取出v1的倒数第⼆个元素
v1[length(v1)-1]

#v1[-1]会返回什么结果，有何启示？
v1[-1]#去除元素'1'

#v1[5]会返回什么结果，有何启示？
v1[5]#NA, 除了确实有的元素，还包括空值

#取出v1中整除3的元素
v1[v1 %% 3 == 0]

#比较得知两者的区别：v1[] <- 99 将整个向量都赋值为99 v1 <- 99则把v1赋值为单一元素99
v1 <- c(1,2,3,4)
v1[] <- 99
print(v1)
v1 <- c(1,2,3,4)
v1 <- 99
print(v1)
v1 <- c(1,2,3,4)

